$(function () {
    var currYear = (new Date()).getFullYear();
    dateConfig = {
        theme: 'ios', //皮肤样式
        display: 'modal', //显示方式
        mode: 'scroller', //日期选择模式
        dateFormat: 'yyyy-mm-dd',
        lang: 'zh',
        showNow: true,
        nowText: "今天",
        startYear: currYear - 100, //开始年份
        endYear: currYear + 20 //结束年份
    };
    start=1970;

    end= 2100;

    $("#StartTime").mobiscroll().date(dateConfig);
    $("#EndTime").mobiscroll().date(dateConfig);

    var min_money = {"北京市":"7086","上海市":"5939","天津市":"4944","重庆市":"5174.25","广州市":"6764","深圳市市":"6752.83","珠海市":"6752.83","汕头市":"3250","韶关市":"4577","佛山市":"5150.83","江门市":"4508.33","湛江市":"4125","茂名市":"4334","肇庆市":"5673","惠州市":"4884","梅州市":"4501.5","汕尾市":"3620","河源市":"4320","阳江市":"4130","清远市":"4468","东莞市":"4435","中山市":"4887","潮州市":"3990.5","揭阳市":"3740","云浮市":"4600","南京市":"5939","无锡市":"5990.17","镇江市":"5490.5","苏州市":"6024","南通市":"5496.42","扬州市":"5264","盐城市":"4365.75","徐州市":"4500","淮安市":"4467.67","连云港市":"4533.5","常州市":"4647","泰州市":"4361.75","宿迁市":"","杭州市":"4659","宁波市":"4796","温州市":"4309.9","嘉兴市":"4309.9","湖州市":"5100","绍兴市":"4247.25","金华市":"4108.75","衢州市":"3654.75","舟山市":"3660","台州市":"4221","丽水市":"4309.9","合肥市":"5302.17","芜湖市":"4659.75","蚌埠市":"4096.17","淮南市":"3308.35","马鞍山市":"4869","淮北市":"4258","铜陵市":"4567.25","安庆市":"3951","黄山市":"2954","滁州市":"4695","阜阳市":"4102","宿州市":"3693.75","六安市":"4279.5","亳州市":"3783","池州市":"4144","宣城市":"4739","武汉市":"5476.67","襄阳市":"3280","荆州市":"3304","宜昌市":"3606.83","十堰市":"3556.33","恩施市":"3430.58","黄冈市":"3002","黄石市":"3455","孝感市":"","随州市":"3254.67","咸宁市":"3070","荆门市":"3304","鄂州市":"3100","郑州市":"4365","洛阳市":"3818","开封市":"3590","南阳市":"3542","安阳市":"3402","商丘市":"3602","新乡市":"3379","信阳市":"3415","濮阳市":"3592","许昌市":"3638","平顶山市":"3706","驻马店市":"3303","漯河市":"3434","焦作市":"3481","周口市":"3547","三门峡市":"3656","鹤壁市":"3266","南昌市":"4959","赣州市":"4192.75","九江市":"4255.42","景德镇市":"3781","吉安市":"4016.75","上饶市":"4201.17","宜春市":"3777.5","抚州市":"4126.83","萍乡市":"4008.33","北京市":"7086","鹰潭市":"4801.92","新余市":"4303.25","长沙市":"5605.5","张家界市":"3579","郴州市":"4090","衡阳市":"3479","株洲市":"4799","常德市":"4055","怀化市":"4084","岳阳市":"4525","湘西市":"4525","湘潭市":"4312","乐山市":"5043","凉山市":"5043","阿坝藏族自治州":"4000.92","资阳市":"5043","甘孜藏族自治州":"5043","贵阳市":"4878.08","遵义市":"4720.42","毕节市":"4172.58","铜仁市":"4713.25","六盘水市":"4061.83","黔东南苗族自治州":"4271.17","黔西南布依族自治州":"4563.08","黔南依族自治州":"4436.75","安顺市":"5043","南宁市":"5318.33","北海市":"4130.17","桂林市":"4493.75","柳州市":"4518.58","玉林市":"3971.5","梧州市":"3955.92","贵港市":"4987.75","百色市":"4150.75","钦州市":"3875.17","河池市":"4469.83","贺州市":"4617.25","来宾市":"4638.75","崇左市":"3969.17","防城港市":"4269.17","昆明市":"4736","西双版纳傣族自治州":"3682","丽江市":"3682","大理白族自治州":"3685","红河哈尼族自治州":"3758","普洱市":"2612","曲靖市":"3373","昭通市":"3684","玉溪市":"3757.33","文山壮族自治州":"3351","楚雄黎族自治州":"3682","保山市":"3941","临沧市":"3014","德宏傣族自治州":"3522","迪庆藏族自治州":"3682","怒江僳僳族自治州":"3682","兰州市":"5027.5","天水市":"3620","张掖市":"3620","酒泉市":"3620","武威市":"3620","庆阳市":"3620","嘉峪关市":"3620","白银市":"3620","临夏回族自治州":"3620","陇南市":"3620","平凉市":"3620","金昌市":"3620","定西市":"3620","甘南藏族自治州":"3620","银川市":"5359","固原市":"5082","中卫市":"4470","吴忠市":"4528","石嘴山市":"4267","西宁市":"4754.5","海东市":"5089.83","海西蒙古自治州":"6136.83","玉树藏族自治州":"4948.92","果洛藏族自治州":"5324.58","海北藏族自治州":"5402.75","海南藏族自治":"4825.25","黄南藏族自治":"5634.75","呼和浩特市":"4475","鄂尔多斯市":"5882","赤峰市":"4615","呼伦贝尔市":"4563","包头市":"4964","通辽市":"4424","乌兰察布市":"4712","乌海市":"4631","巴彦淖尔市":"4264","锡林郭勒盟":"5183","阿拉善盟":"5046","兴安盟":"4573","乌鲁木齐市":"4417","伊犁哈萨克自治州":"4417","巴音郭勒蒙古自治州":"4417","吐鲁番市":"4417","哈密市":"4417","喀  什市":"4417","阿勒泰市":"4417","和田市":"4417","昌吉市":"4417","吐鲁番市":"4417","阿克苏市":"4417","博尔塔拉蒙古自治州":"4417","克孜勒苏柯尔克孜自治州":"4417","塔城市":"4417","海口市":"4788","三亚市":"6168","三沙市":"4417","儋州市":"4417","邵阳市":"4525","娄底市":"3665","益阳市":"4060","石家庄市":"4455.5","邯郸市":"3744","保定市":"4035","秦皇岛市":"4579","唐山市":"4534","张家口市":"3916","廊坊市":"5288","邢台市":"3782.25","沧州市":"4388","承德市":"3941","衡水市":"3862","济南市":"4882","青岛市":"4476","临沂市":"4693","济宁市":"4319.08","潍坊市":"4850","烟台市":"4849.75","威海市":"4039","淄博市":"4495","聊城市":"3483","日照市":"4561","菏泽市":"3720.5","泰安市":"4687","枣庄市":"4139","东营市":"3792","德州市":"3943","滨州市":"4450","莱芜市":"4104","西安市":"5266","宝鸡市":"3990.5","鞍山市":"3355.25","盘锦市":"3465","抚顺市":"3543.92","铁岭市":"3314","朝阳市":"3023.42","本溪市":"3451.59","阜新市":"3213.17","辽阳市":"3859.17","锦州市":"3453.67","长春市":"5087","延边朝鲜自治州":"5260","吉林市":"4045.33","四平市":"3725.17","松原市":"3974.33","白城市":"3132.17","通化市":"3639.25","白山市":"3466.17","辽源市":"3582.17","哈尔滨市":"3920","齐齐哈尔市":"3920","牡丹江市":"3920","佳木斯市":"3920","大庆市":"3920","黑河市":"3920","绥化市":"3920","鸡西市":"3920","宜春市":"3920","大兴安岭市":"3920","双鸭山市":"3920","七台河市":"3920","鹤岗市":"3920","福州市":"5260","厦门市":"5359.92","莆田市":"4365","泉州市":"4503.67","漳州市":"4686","宁德市":"4719","南平市":"4950","三明市":"4817","龙岩市":"4620","成都市":"4790","绵阳市":"3720","南充市":"5043","自贡市":"4685","泸州市":"5043","攀枝花市":"5043","宜宾市":"5043","达州市":"3968.25","广元市":"4718","眉山市":"3781","遂宁市":"5043","巴中市":"3923.67","广安市":"3267.75","内江市":"3457.75","德阳市":"4950.92","雅安市":"5043","汉中市":"4284.25","咸阳市":"3820.75","延安市":"4470.92","安康市":"4052.33","榆次市":"4693.42","渭南市":"3542.33","商洛市":"3155.84","铜川市":"3155.84","太原 市":"4413.33","大同市":"4413.33","运城市":"4413.33","长治市":"4413.33","临汾市":"4413.33","吕梁市":"4413.33","忻州市":"4413.33","晋城市":"4413.33","阳泉市":"4413.33","朔州市":"4413.33","晋中市":"4413.33","沈阳市":"5152.25","大连市":"5783","丹东市":"2679.17","葫芦岛市":"3367.6","营口市":"3516"};
    for(var min_money_key in min_money){
        $("select[name^=workcity]").append("<option value='"+min_money[min_money_key]+"'>"+min_money_key+"</option>");
    }

})
$('#submitFees').on('click',function () {
    var startTime=$('#StartTime').val()
    var endTime=$('#EndTime').val()
    var money=$('#money').val()
    var workCity=$('select[name^=workcity] option:selected').val()
    if(startTime == ''){
        alert("请选择开始时间")
        return false
    }
    if(endTime == ''){
        alert("请选择结束时间")
        return false
    }
    if(money == ''){
        alert("请输入平均工资")
        return false
    }
    var lasttime=lastTime(startTime,endTime)
    if(lasttime<=0){
        alert('结束时间不能小于开始时间')
        return false
    }
    var year=Math.floor(lasttime/360)
    var surplusDay =lasttime%360
    if(surplusDay>=180) {year++}
    if(surplusDay>30&&surplusDay<180)  {year+=0.5}
    if(money<workCity) {money=workCity}
    if(money>parseFloat(workCity)*3) {money=parseFloat(workCity)*3}
     var resultMoney = money*year
    showResult(resultMoney,year)

})


// 计算两时间相差多少天，如果需要小时的话，除24即可
function lastTime(startTime, endTime){
    var st = new Date(startTime);
    var et = new Date(endTime);
    return (et.getTime() - st.getTime()) / 86400000;
}

function showResult(money,month) {
    var rateHtml='<div class="jsjg-content"><h2 class="tc w100 color-1b0000 jsjg-title">计算结果</h2>' +
        '<p class="jsjg-detail tl pl10">经济补偿金（元）：<span class="fr tr pr15">'+money+'元</span></p>' +
        '<p class="jsjg-detail tl pl10">补偿月数（月）：<span class="fr tr pr15">'+month+'个月</span></p>' +
        '</div>'

    layer.open({
        content: rateHtml
    });
}
